app/controllers/productcategories_controller.rb

  def index
    @productcategories = Productcategory.all
---
SELECT "productcategories".* FROM "productcategories"

  def create
    @productcategory = Productcategory.new(productcategory_params)

    respond_to do |format|
      if @productcategory.save
---
INSERT INTO "productcategories" ("CategoryID", "CategoryName", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["CategoryID", "pc1"], ["CategoryName", "Handmade"], ["created_at", "2017-09-25 06:20:29.105231"], ["updated_at", "2017-09-25 06:20:29.105231"]]

    def set_productcategory
      @productcategory = Productcategory.find(params[:id])
---
SELECT  "productcategories".* FROM "productcategories" WHERE "productcategories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]