app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("ProductID", "ProductName", "ProductImage", "ProductStatus", "Roots", "Description", "Rate", "Digital", "Customer_question", "Feedback", "ProductCategoryID", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE "products" SET "ProductImage" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["ProductImage", "Personalized_BirthstoneJewelry"], ["updated_at", "2017-09-26 07:05:44.774033"], ["id", 2]]