app/controllers/userlogins_controller.rb

SELECT "userlogins".* FROM "userlogins"
---
  def index
    @userlogins = Userlogin.all

INSERT INTO "userlogins" ("userid", "username", "useremail", "userpass", "comment", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @userlogin = Userlogin.new(userlogin_params)

    respond_to do |format|
      if @userlogin.save

UPDATE "userlogins" SET "comment" = $1, "updated_at" = $2 WHERE "userlogins"."id" = $3  [["comment", "Member"], ["updated_at", "2017-09-19 02:30:38.013967"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @userlogin.update(userlogin_params)

SELECT  "userlogins".* FROM "userlogins" WHERE "userlogins"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_userlogin
      @userlogin = Userlogin.find(params[:id])